# if df is a dataframe that includes a  column year what does df.groupby('year') do?

In [71]:
import pandas as pd

In [72]:
df = pd.read_csv('dataset.csv') # read the dataset

In [73]:
df # display the dataframe

    ID First Name Last Name  Year      Type
0  123     Janye      Smith  1919   Kitchen
1  123     Janye      Smith  1918  Bathroom
2  155      Nancy     Smith  1920   Kitchen
3  144       John     Smith  1914   Kitchen
4  144       John     Smith  1913  Bathroom
5  105      Nancy     Smith  1917       Bat
6  114       John     Smith  1916      Ball
7  124       John     Smith  1916  Bathroom

In [74]:
df.groupby('Year')

In [75]:
df.groupby('Year').max()

       ID First Name Last Name      Type
Year
1913  144       John     Smith  Bathroom
1914  144       John     Smith   Kitchen
1916  124       John     Smith  Bathroom
1917  105      Nancy     Smith       Bat
1918  123     Janye      Smith  Bathroom
1919  123     Janye      Smith   Kitchen
1920  155      Nancy     Smith   Kitchen

In [76]:
df.groupby('Year').sum()

       ID
Year
1913  144
1914  144
1916  238
1917  105
1918  123
1919  123
1920  155

# how many different indices may a Dataframe have

In [77]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [78]:
list(df.index)

[0, 1, 2, 3, 4, 5, 6, 7]

In [79]:
len(df.index) # indices can be more than 3

8

# if we are working with dataframe df indexed  by year,what would df.loc[1914:1918] return?

In [80]:
df = df.set_index('Year')
df

       ID First Name Last Name      Type
Year
1919  123     Janye      Smith   Kitchen
1918  123     Janye      Smith  Bathroom
1920  155      Nancy     Smith   Kitchen
1914  144       John     Smith   Kitchen
1913  144       John     Smith  Bathroom
1917  105      Nancy     Smith       Bat
1916  114       John     Smith      Ball
1916  124       John     Smith  Bathroom

In [82]:
df.sort_index(inplace=True)

In [83]:
df.loc[1914:1918]

       ID First Name Last Name      Type
Year
1914  144       John     Smith   Kitchen
1916  114       John     Smith      Ball
1916  124       John     Smith  Bathroom
1917  105      Nancy     Smith       Bat
1918  123     Janye      Smith  Bathroom

In [88]:
df.loc(1913,'Type')

TypeError: __call__() takes from 1 to 2 positional arguments but 3 were given

In [85]:
df

       ID First Name Last Name      Type
Year
1913  144       John     Smith  Bathroom
1914  144       John     Smith   Kitchen
1916  114       John     Smith      Ball
1916  124       John     Smith  Bathroom
1917  105      Nancy     Smith       Bat
1918  123     Janye      Smith  Bathroom
1919  123     Janye      Smith   Kitchen
1920  155      Nancy     Smith   Kitchen